cf/Enums/PeripheralTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>PeripheralTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BarCodeScanner</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MagneticCardReader</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FiscalRegister</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CustomerDisplay</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DataCollectionTerminal</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POSTerminal</Name>
					<Comment>POSTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ElectronicScales</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LabelsPrintingScales</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashRegistersOffline</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/Peripherals.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Peripherals</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EquipmentType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIdentifier</Name>
					<Comment>Unique identifier of hardware standard device</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceDisconnected</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeviceIsInUse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HardwareDriver</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HardwareDrivers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameters</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Workplace</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Workplaces</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReinstallationRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InstallationIsRequired</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRule</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ExchangeWithPeripheralsOfflineRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Comment>Intended for exchange with offline equipment</Comment>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ExchangeWithPeripheralsOffline</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SerialNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComponentVersion</Name>
					<Comment>Component Version</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteDriverHandler</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PeripheralDriverHandlers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/AutomaticExchangeWithPeripheralsOffline/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - FORM EVENT HANDLERS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Query = New Query(
	"SELECT
	|	CatalogPeripherals.Ref AS Device,
	|	CatalogPeripherals.EquipmentType AS EquipmentType
	|FROM
	|	Catalog.Peripherals AS CatalogPeripherals
	|		INNER JOIN Catalog.CashRegisters AS CashRegisters
	|		ON (CashRegisters.Peripherals = CatalogPeripherals.Ref)
	|WHERE
	|	CatalogPeripherals.EquipmentType = VALUE(Enum.PeripheralTypes.CashRegistersOffline)
	|	AND CatalogPeripherals.ExchangeRule <> VALUE(Catalog.ExchangeWithPeripheralsOfflineRules.EmptyRef)
	|	AND CatalogPeripherals.DeviceIsInUse
	|
	|UNION ALL
	|
	|SELECT
	|	CatalogPeripherals.Ref,
	|	CatalogPeripherals.EquipmentType
	|FROM
	|	Catalog.Peripherals AS CatalogPeripherals
	|WHERE
	|	CatalogPeripherals.EquipmentType = VALUE(Enum.PeripheralTypes.LabelsPrintingScales)
	|	AND CatalogPeripherals.ExchangeRule <> VALUE(Catalog.ExchangeWithPeripheralsOfflineRules.EmptyRef)
	|	AND CatalogPeripherals.DeviceIsInUse");
	
	Query.SetParameter("CurrentWorksPlace", Parameters.Workplace);
	
	Result = Query.Execute();
	Selection = Result.Select();
	
	While Selection.Next() Do
		
		NewRow = Equipment.Add();
		NewRow.ExecuteExchange         = True;
		NewRow.Device                  = Selection.Device;
		NewRow.EquipmentType           = Selection.EquipmentType;
		NewRow.ExportStatus          = NStr("en='<Export was not made>';ru='<Выгрузка не производилась>'");
		NewRow.ImportingPictureIndex   = 1;
		NewRow.ExportingPictureIndex = 1;
		
		If NewRow.EquipmentType = Enums.PeripheralTypes.LabelsPrintingScales Then
			NewRow.ImportStatus = NStr("en='<Not needed>';ru='<Not needed>'");
		Else
			NewRow.ImportStatus = NStr("en='<Import was not made>';ru='<Загрузка не производилась>'");
		EndIf;
		
	EndDo;
	
	State = "";
	
	Items.Start.Enabled              = True;
	Items.Complete.Enabled           = False;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - COMMAND HANDLERS

&AtClient
Procedure Start(Command)
	
	ClearMessages();
	
	If Not ValueIsFilled(ExchangePeriodicity) Then
		CommonUseClientServer.MessageToUser(NStr("en='Frequency of exchange with equipment is not specified';ru='Не задана периодичность обмена с оборудованием'"),,"ExchangePeriodicity");
		Return;
	EndIf;
	
	If Not IsEquipmentForExchange() Then
		CommonUseClientServer.MessageToUser(NStr("en='Equipment for exchange is not selected';ru='Не выбрано оборудование для обмена'"),,"Equipment");
		Return;
	EndIf;
	
	Items.ExchangePeriodicity.Enabled              = False;
	Items.EquipmentExecuteExchange.Enabled         = False;
	Items.EquipmentCheckAll.Enabled                = False;
	Items.EquipmentUncheckAll.Enabled              = False;
	Items.EquipmentContextMenuCheckAll.Enabled     = False;
	Items.EquipmentContextMenuUncheckAll.Enabled   = False;
	
	Items.Start.Enabled              = False;
	Items.Complete.Enabled           = True;
	
	State = NStr("en='Exchange with the peripherals is being performed...';ru='Выполняется обмен с подключенным оборудованием...'");
	
	AttachIdleHandler("ExchangeExpectationsHandler", ExchangePeriodicity * 60, False);
	
	ExchangeInProgress = True;
	
EndProcedure

&AtClient
Procedure Complete(Command)
	
	Items.ExchangePeriodicity.Enabled             = True;
	Items.EquipmentExecuteExchange.Enabled        = True;
	Items.EquipmentCheckAll.Enabled               = True;
	Items.EquipmentUncheckAll.Enabled             = True;
	Items.EquipmentContextMenuCheckAll.Enabled    = True;
	Items.EquipmentContextMenuUncheckAll.Enabled  = True;
	
	Items.Start.Enabled              = True;
	Items.Complete.Enabled           = False;
	
	State = NStr("en='Exchange completed.';ru='Обмен завершен.'");
	
	DetachIdleHandler("ExchangeExpectationsHandler");
	
	ExchangeInProgress = False;
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	If ExchangeInProgress Then
		
		ShowMessageBox(, NStr("en='After the form is closed, exchange with equipment will not be performed.';ru='После закрытия формы обмен с оборудованием выполняться не будет.'"));
		
	EndIf;
	
EndProcedure

&AtClient
Procedure CheckAll(Command)
	SetCheckboxesOnServer();
EndProcedure

&AtClient
Procedure UncheckAll(Command)
	RemoveCheckboxesOnServer();
EndProcedure

&AtClient
Procedure ExecuteNow(Command)
	
	State = NStr("en='Exchange with the peripherals is being performed...';ru='Выполняется обмен с подключенным оборудованием...'");
	RunExchange();
	State = NStr("en='Exchange completed.';ru='Обмен завершен.'");
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

////////////////////////////////////////////////////////////////////////////////
// Other

&AtClient
Procedure RunExchange()
	
	For Each TSRow IN Equipment Do
		
		If Not TSRow.ExecuteExchange Then
			Continue;
		EndIf;
		
		DeviceArray = New Array;
		DeviceArray.Add(TSRow.Device);
		
		// Data export
		MessageText = "";
		NotificationOnImplementation = New NotifyDescription(
			"ExecuteExchangeEnd",
			ThisObject,
			New Structure ("MessageText, TSRow, DeviceArray", MessageText, TSRow, DeviceArray)
		);
		
		PeripheralsOfflineClient.AsynchronousExportProductsInEquipmentOffline(TSRow.EquipmentType, DeviceArray, MessageText, False, NotificationOnImplementation, True);
		
	EndDo;
	
EndProcedure

&AtClient
Procedure ExecuteExchangeEnd(Result, Parameters) Export
	
	Parameters.TSRow.ExportStatus = Parameters.MessageText;
	Parameters.TSRow.ExportingPictureIndex = ?(Result, 1, 0);
	Parameters.TSRow.ExportEndDate = CurrentDate();
	
	// Data Import
	If Parameters.TSRow.EquipmentType = PredefinedValue("Enum.PeripheralTypes.CashRegistersOffline") Then
		
		MessageText = "";
		
		NotificationOnImplementation = New NotifyDescription(
			"ExecuteImportEnd",
			ThisObject,
			Parameters
		);
		
		PeripheralsOfflineClient.AsynchronousImportReportAboutRetailSales(Parameters.DeviceArray,,, NotificationOnImplementation);
		
	EndIf;
	
EndProcedure

&AtClient
Procedure ExecuteImportEnd(Result, Parameters) Export
	
	Parameters.TSRow.ExportStatus = Parameters.MessageText;
	Parameters.TSRow.ExportingPictureIndex = ?(Result, 1, 0);
	Parameters.TSRow.ExportEndDate = CurrentDate();
	
EndProcedure


&AtClient
Procedure ExchangeExpectationsHandler()
	
	RunExchange();
	
	DetachIdleHandler("ExchangeExpectationsHandler");
	AttachIdleHandler("ExchangeExpectationsHandler", ExchangePeriodicity * 60, False);
	
EndProcedure

&AtServer
Procedure SetCheckboxesOnServer()
	
	For Each TSRow IN Equipment Do
		TSRow.ExecuteExchange = True;
	EndDo;
	
EndProcedure

&AtServer
Procedure RemoveCheckboxesOnServer()
	
	For Each TSRow IN Equipment Do
		TSRow.ExecuteExchange = False;
	EndDo;
	
EndProcedure

&AtServer
Function IsEquipmentForExchange()
	
	Return Equipment.FindRows(New Structure("ExecuteExchange", True)).Count() > 0;
	
EndFunction
